# Python for Data Analysis

In [1]:
#Import Python Libraries
import numpy as np
# import scipy as sp
import pandas as pd
# import matplotlib.pyplot as plt
# import seaborn as sns

Library ที่สำคัญในงาน ด้านข้อมูล หรือด้าน Data Science
1. **Pandas** เป็น library ที่สำคัญมากๆ การที่เราจะจัดการข้อมูลใดๆนั้น เราจำเป็นที่จะต้อง import ข้อมูลนั้น และแสดงข้อมูลออก ซึ่งเราจะใช้คำสั่งจากเจ้าตัว Pandas นี่แหละ เจ้าตัว Pandas สามารถอ่านไฟล์ได้เกือบทั้งหมดไม่ว่าจะเป็นแบบ FWF,CSV, Excel,Zip,TSV แต่มันยังไม่หมดแค่นั้น Pandas ยังมีคำสั่งที่จะช่วยเตรียมข้อมูลให้สมบูรณ์ก่อนที่จะนำไปคำนวณอีกด้วย จึงเป็น Library ที่ใช้ในด้าน Data Science ได้นั้นเอง

2. **Numpy** คือ library ที่เกี่ยวกับฟังก์ชั่นทางคณิตศาสตร์และการคำนวณต่างๆ โดยจะเข้าไปจัดการข้อมูลที่เป็นตารางแบบ array

3. **Matplotlib** เป็น library พื้นฐานในการสร้างกราฟจาก array กรอกค่าแสดงความสัมพันธ์ของตัวแปร ซึ่งสามารถสร้างกราฟได้ทั้งในเเบบ 2 มิติ , 3 มิติ, กราฟเส้นตรง, พาราโบลา และกราฟอื่นๆได้อีกมากมาย แต่ทั้งนี้การที่มันจะทำงานได้ ต้องมีการใช้ควบคู่ไปกับ numpy(ตรงนี้สำคัญ)

4. **Seaborn** หากใครที่ต้องการพ็อตกราฟให้สวยขึ้นไปอีก ต้องไม่พลาด library seaborn ตัวนี้ ที่ถูกพัฒนาขึ้นมาจาก Matplolib อีกที

5. **Scikit-learn (sklearn)** เป็น library ที่สำคัญมากในการทำ Machine Learning ซึ่ง Scikit-learn มี code ที่สามารถจัดการข้อมูลได้หลากหลายมาก ไม่ว่าจะเป็นการทำ Clustering , Classification , regression ซึ่งในที่นี้เราจะให้คอมพิวเตอร์เรียนรู้แบบ linear regression เเละยังสามารถนำมาประยุกต์ใช้กับ Data Science ได้อีกด้วย
https://stackpython.medium.com/%E0%B8%AA%E0%B8%AD%E0%B8%99%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%95%E0%B8%B4%E0%B8%94%E0%B8%95%E0%B8%B1%E0%B9%89%E0%B8%87-jupyter-notebook-1850bf72d8b1

In [10]:
#Read csv file
df = pd.read_csv("Salaries.csv") 
#df = pd.read_csv("E:/520215/Salaries.csv")

In [11]:
#Display a few first records >> head([number or not])
df.head(10)
# < your codes >

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

# Practice

In [12]:
#Display first 10 records

# < your codes >

# display 2 column in dataframe >> dataframe[["col1","col2",..]]

# < your codes >
df.rank
df[['service','sex']].head(5)

   service   sex
0       49  Male
1        6  Male
2       20  Male
3       31  Male
4       18  Male

In [ ]:
#Display the last 5 records >> tail([number or not])

# < your codes >

In [15]:
#Identify the type of df object >> type(dataframe)

# < your codes >
type(df)
type(df['salary']) # เช็คเฉพาะ columnนั้นๆ

pandas.core.series.Series

In [ ]:
#Check the type of a column "salary" >> method dtype

# < your codes >

In [16]:
#List the types of all columns >> method dtypes

# < your codes >
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [ ]:
#List the column names >> method columns

# < your codes >

In [17]:
#List the row labels and the column names >> method axes

# < your codes >
df.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [19]:
#Number of dimensions >> method ndim
df.ndim # มิติของ data frame
# < your codes >

2

In [20]:
#Total number of elements in the Data Frame >> method size
df.size # แถว x คอร์ลัม

# < your codes >

468

In [21]:
#Number of rows and columns >> method shape

# < your codes >
df.shape #แสดงแถวกับคอร์ลัม

(78, 6)

In [22]:
#Output basic statistics for the numeric columns >> method describe()

# < your codes >
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [23]:
#Calculate mean for all numeric columns >> method mean()

# < your codes >
df.mean() #ค่าเฉลี่ยเฉพาะข้อมูลที่เป็นตัวเลข

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [24]:
# display first 4 records in sex column --1   >> dataframe.col.head(number)

# < your codes >
df.sex.head(1) # data frame . column . ข้อมูลที่เราจะใช้

0    Male
Name: sex, dtype: object

In [26]:
# display first 4 records in sex column --2 >> dataframe['col'].head(number)

# < your codes >
df['sex'].head(4)# data frame [column] . ข้อมูลที่เราจะใช้

0    Male
1    Male
2    Male
3    Male
Name: sex, dtype: object

In [29]:
# display range of records in columns >> dataframe[['col']][begin:end]

# < your codes >
df[['sex']].head(5) #แสดงผลคล้ายๆกับ excel
df[['sex']][3:8] # แสดงช่วงของการเข้าถึง

    sex
3  Male
4  Male
5  Male
6  Male
7  Male

หา ค่าเฉลี่ย (mean), ค่าเบี่ยงเบนมาตรฐาน (std),มากที่สุด (max),น้อยที่สุด (min) ด้วย numpy

In [30]:
# < your codes (mean) >
np.mean(df)

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [31]:
#Calculate the standard deviation (std() method) for all numeric columns
# <your code goes here>
np.std(df)

phd           12.418048
service       12.061698
salary     28111.706331
dtype: float64

In [34]:
#Calculate average of the columns in the first 50 rows

# < your codes >
df.head(50).max() # แบบ pandas
np.mean(df.head(50)) # แบบ numpy

phd            21.52
service        17.60
salary     113789.14
dtype: float64

---
### Data slicing and grouping

In [35]:
#Extract a column by name (method 1)
#dataframe['col'].head()
df['salary'].head()
# < your codes >

0    186960
1     93000
2    110515
3    131205
4    104800
Name: salary, dtype: int64

In [ ]:
#Extract a column name (method 2)
# dataframe.col.head()

# < your codes >

In [ ]:
#Calculate the basic statistics for the salary column (used describe() method)

# < your codes >

In [36]:
#Calculate how many values in the salary column (use count() method)

# < your codes >
df.count()

rank          78
discipline    78
phd           78
service       78
sex           78
salary        78
dtype: int64

In [37]:
#Calculate the average (use mean()) salary

# < your codes >
df[['salary','service']].mean()

salary     108023.782051
service        15.051282
dtype: float64

In [38]:
# numpy method (use np.mean())

# < your codes >
np.mean(df[['salary','service']])

salary     108023.782051
service        15.051282
dtype: float64

---

In [40]:
#Group data using rank >> groupby('col',sort=[Ture or False])
df_rank = df.groupby('sex') #แบ่งกลุ่มตาม columnที่เราเลือก
df_rank.head()  #แสดงผลข้อมูลที่ได้จากการแยกตาม rank

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000

In [41]:
#Group data using rank , sort is True

# < your codes >
df_rank = df.groupby('rank',sort = True)
df_rank.head()

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
6   AssocProf          A   20       17    Male   81285
12   AsstProf          B    1        0    Male   88000
16   AsstProf          B    8        3    Male   75044
17   AsstProf          B    4        0    Male   92000
20   AsstProf          B    4        4    Male   92000
22   AsstProf          A    4        2    Male   73000
30  AssocProf          B    9        7    Male  107008
34  AssocProf          B   12        8    Male  119800
41  AssocProf          A   13        8  Female   74830
47  AssocProf          B   11       11  Female  103613

In [46]:
#Calculate mean of all numeric columns for the grouped object

# < your codes >
df_rank.mean()
df.groupby('rank',sort = True).mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [48]:
#Group data using sex


# < your codes >
df.groupby('sex',sort = True).head().mean()

phd            23.0
service        18.8
salary     112453.5
dtype: float64

In [51]:
#Calculate the mean salary for men and women. >> dataframe.groupby('col group')['col'].mean()

# < your codes >
df.groupby('sex')['salary'].mean() # กลุ่ม ('col group') แล้วเรียง ['col']

sex
Female    101002.410256
Male      115045.153846
Name: salary, dtype: float64

In [53]:
# ถ้าใช้วงเล็บก้ามปูที่ attribute salary ผลลัพธ์จะแสดงออกมาเป็น dataframe 
# >>  dataframe.groupby('col group')[['col']].mean()

# < your codes >
df.groupby('sex')[['salary','phd']].mean() # กลุ่ม ('col group') แล้วเรียง ['col']

               salary        phd
sex
Female  101002.410256  16.512821
Male    115045.153846  22.897436

In [54]:
# Group using 2 variables - sex and rank:
# dataframe.groupby(['col group1','col group2'], sort=True)[['col']].mean()

# < your codes >
df.groupby(['sex','rank'])['salary','phd'].mean()

                         salary        phd
sex    rank
Female AssocProf   88512.800000  15.500000
       AsstProf    78049.909091   5.636364
       Prof       121967.611111  23.722222
Male   AssocProf  102697.666667  13.666667
       AsstProf    85918.000000   4.250000
       Prof       124690.142857  29.214286

---
*Exercise*

In [ ]:
# Group data by the discipline and find the average salary for each group

# < your codes >

---
### Filtering

In [56]:
#Select observation with the value in the salary column > 120K
# dataframe[dataframe['col1'] condition]
df_sub = df[df['salary'] > 120000]
df_sub.head()

    rank discipline  phd  service   sex  salary
0   Prof          B   56       49  Male  186960
3   Prof          A   40       31  Male  131205
5   Prof          A   20       20  Male  122400
7   Prof          A   18       18  Male  126300
10  Prof          B   39       33  Male  128250

In [59]:
#Select data for female professors
# dataframe[ dataframe['col'] == 'valueKey']

# multiple conditions
# dataframe[ (dataframe['col1'] == 'valueKey1') and (dataframe['col2'] == 'valueKey2')]

# < your codes >
df[ (df['sex'] == 'Male') & (df['salary'] >= 100000)]

         rank discipline  phd  service   sex  salary
0        Prof          B   56       49  Male  186960
2        Prof          A   23       20  Male  110515
3        Prof          A   40       31  Male  131205
4        Prof          B   20       18  Male  104800
5        Prof          A   20       20  Male  122400
7        Prof          A   18       18  Male  126300
10       Prof          B   39       33  Male  128250
11       Prof          B   23       23  Male  134778
13       Prof          B   35       33  Male  162200
14       Prof          B   25       19  Male  153750
15       Prof          B   17        3  Male  150480
18       Prof          A   19        7  Male  107300
19       Prof          A   29       27  Male  150500
21       Prof          A   33       30  Male  103106
26       Prof          A   38       19  Male  148750
27       Prof          A   45       43  Male  155865
29       Prof          B   21       20  Male  123683
30  AssocProf          B    9        7  Male  107008
31       Prof          B   22       21  Male  155750
32       Prof          A   27       19  Male  103275
33       Prof          B   18       18  Male  120000
34  AssocProf          B   12        8  Male  119800
35       Prof          B   28       23  Male  126933
36       Prof          B   45       45  Male  146856
37       Prof          A   20        8  Male  102000

---
*Excecise*

In [ ]:
# Using filtering, find the mean value of the salary for the discipline A
# ปัดทศนิยม round(number)

# < your codes >

In [ ]:
# Challange:
# Extract (filter) only observations with high salary ( > 100K) 
# and find how many female and male professors in each group


# < your codes >

In [ ]:
#find the mean value of the salary of Woman    method 1
# dataframe( condition ).garoup('col')['col'].mean()

# < your codes >

In [ ]:
#find the mean value of the salary of Woman      method 2
#df1 = df[(df['C']=='True') or (df['D']=='True')]
#หรือจะใช้คำสั่ง np.mean(df[df['sex'] == 'Female']['salary'])
df[df['sex'] == 'Female']['salary'].mean() 

# < your codes >

In [ ]:
#find the mean value of the salary of Women who has salary > 100000, use bitwise operator
df[(df['sex'] == 'Female') & (df['salary'] > 100000)] 

# < your codes >

---
### More on slicing the dataset

In [ ]:
#Select column salary
# < your codes ># < your codes >

In [ ]:
#Check data type of the result
# < your codes >

In [ ]:
#Look at the first few elements of the output
# < your codes >

In [ ]:
#Select column salary and make the output to be a data frame
# < your codes >

In [ ]:
#Check the type
# < your codes >

In [ ]:
#Select a subset of rows (based on their position):
# Note 1: The location of the first row is 0
# Note 2: The last value in the range is not included
# < your codes >

In [ ]:
#If we want to select both rows and columns we can use method .loc
# datafrme.loc[begin:end,['col1', 'col2','col3']]

# < your codes >

In [ ]:
#Display first 15 records in df_sub

# < your codes >

In [ ]:
#Let's see what we get for our df_sub data frame
# Method .loc subset the data frame based on the labels:

# < your codes >

### Sorting the Data

In [ ]:
#Sort the data frame by yrs.service and create a new data frame

# dataframe.sort_values(by = 'col', ascending = False, inplace = True)

# ascending >>  if True น้อยไปมาก
# inplace >> If True, perform operation in-place.

df_sorted = # < your codes >
df_sorted.head()

In [ ]:
#Sort the data frame by yrs.service and overwrite the original dataset

# < your codes >

# df.head()

In [ ]:
# Sort data frame by the salary (in descending order) 
# and display the first few records of the output (head)

# < your codes >

In [61]:
#Sort the data frame using 2 or more columns:
# dataframe.sort_values(by = ['col1','col2'] ,ascending = [True,False])
df_sorted = df.sort_values(by = ['salary'] ,ascending = [False])
df_sorted.head(10)

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
13  Prof          B   35       33    Male  162200
72  Prof          B   24       15  Female  161101
27  Prof          A   45       43    Male  155865
31  Prof          B   22       21    Male  155750
14  Prof          B   25       19    Male  153750
44  Prof          B   23       19  Female  151768
19  Prof          A   29       27    Male  150500
15  Prof          B   17        3    Male  150480
26  Prof          A   38       19    Male  148750